import React, { useContext, useEffect } from 'react';
import { useState } from 'react';
import AdminContext from '../../store/admin-ctx';
import AdminCards from '../../UI/Cards/AdminCards';
import FeedbacksTable from '../../components/admin/tables/FeedbacksTable';

const AllFeedbacks = () => {



  const currentFeedbacks = [
    {
      id: 1,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'pennding'
    },
    {
      id: 2,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'canceled'
    },
    {
      id: 3,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'pennding'
    },
    {
      id: 4,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'approved'
    },
    {
      id: 5,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'approved'
    },
    {
      id: 6,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'pennding'
    },
    {
      id: 7,
      name: 'مصطفي كامل أحمد',
      comment: 'هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده هذا تصميم لتطبيق جوال لبيع النباتات ، يمكنك أن تجد كل ما تريده من أنواع مختلفة من النباتات والاختيار من بينها ، ثم يمكنك شحنها إلى أي مكان تريده..',
      date: '22 ديسمبر',
      status: 'canceled'
    },
  ];

  const ctx = useContext(AdminContext);
  const [feedbacks, setFeedbacks] = useState([]);


  useEffect(() => {
    ctx.setTitle('أراء الناس')
    setFeedbacks(currentFeedbacks)
  }, [])
  
  return (
    <AdminCards>
      <FeedbacksTable currentData={feedbacks}/>
    </AdminCards>
  )
}

export default AllFeedbacks